{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 32, 160, 3], "output_shape": [32, 160, 3], "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-18-9a71d7a5ea64>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "input_dtype": "float32", "trainable": true, "function_type": "lambda", "arguments": {}}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "trainable": true, "border_mode": "same", "bias": true, "name": "convolution2d_1", "activity_regularizer": null, "nb_row": 5, "subsample": [4, 4], "activation": "linear", "b_constraint": null, "nb_filter": 16, "W_regularizer": null, "dim_ordering": "tf", "nb_col": 5, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "trainable": true, "border_mode": "same", "bias": true, "name": "convolution2d_2", "activity_regularizer": null, "nb_row": 3, "subsample": [2, 2], "activation": "linear", "b_constraint": null, "nb_filter": 32, "W_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "trainable": true, "border_mode": "same", "bias": true, "name": "convolution2d_3", "activity_regularizer": null, "nb_row": 3, "subsample": [2, 2], "activation": "linear", "b_constraint": null, "nb_filter": 64, "W_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"input_dim": null, "b_regularizer": null, "trainable": true, "name": "dense_1", "activity_regularizer": null, "bias": true, "output_dim": 512, "activation": "linear", "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"input_dim": null, "b_regularizer": null, "trainable": true, "name": "dense_2", "activity_regularizer": null, "bias": true, "output_dim": 1, "activation": "linear", "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null}}]}