{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "nb_col": 3, "activation": "linear", "trainable": true, "activity_regularizer": null, "subsample": [2, 2], "nb_filter": 24, "nb_row": 3, "batch_input_shape": [null, 44, 160, 3], "init": "glorot_uniform", "border_mode": "same", "input_dtype": "float32", "b_regularizer": null, "bias": true, "W_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "nb_col": 3, "activation": "linear", "trainable": true, "activity_regularizer": null, "subsample": [2, 2], "nb_filter": 36, "nb_row": 3, "name": "convolution2d_2", "init": "glorot_uniform", "border_mode": "same", "b_regularizer": null, "bias": true, "W_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "nb_col": 3, "activation": "linear", "trainable": true, "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 48, "nb_row": 3, "name": "convolution2d_3", "init": "glorot_uniform", "border_mode": "same", "b_regularizer": null, "bias": true, "W_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.4, "name": "dropout_1", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "b_constraint": null, "activation": "linear", "name": "dense_1", "activity_regularizer": null, "b_regularizer": null, "input_dim": null, "output_dim": 100, "W_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.4, "name": "dropout_2", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "b_constraint": null, "activation": "linear", "name": "dense_2", "activity_regularizer": null, "b_regularizer": null, "input_dim": null, "output_dim": 50, "W_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.4, "name": "dropout_3", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "b_constraint": null, "activation": "linear", "name": "dense_3", "activity_regularizer": null, "b_regularizer": null, "input_dim": null, "output_dim": 1, "W_constraint": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null}}], "keras_version": "1.1.2"}