{"config": [{"config": {"arguments": {}, "output_shape": [44, 160, 3], "name": "lambda_1", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-17-19a9f5c753a5>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "function_type": "lambda", "batch_input_shape": [null, 44, 160, 3], "input_dtype": "float32"}, "class_name": "Lambda"}, {"config": {"bias": true, "nb_col": 1, "W_regularizer": null, "activation": "linear", "nb_row": 1, "name": "convolution2d_1", "border_mode": "same", "b_constraint": null, "nb_filter": 3, "dim_ordering": "tf", "W_constraint": null, "subsample": [1, 1], "b_regularizer": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"bias": true, "nb_col": 5, "W_regularizer": null, "activation": "linear", "nb_row": 5, "name": "convolution2d_2", "border_mode": "same", "b_constraint": null, "nb_filter": 24, "dim_ordering": "tf", "W_constraint": null, "subsample": [2, 2], "b_regularizer": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"bias": true, "nb_col": 5, "W_regularizer": null, "activation": "linear", "nb_row": 5, "name": "convolution2d_3", "border_mode": "same", "b_constraint": null, "nb_filter": 36, "dim_ordering": "tf", "W_constraint": null, "subsample": [2, 2], "b_regularizer": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"bias": true, "nb_col": 5, "W_regularizer": null, "activation": "linear", "nb_row": 5, "name": "convolution2d_4", "border_mode": "same", "b_constraint": null, "nb_filter": 48, "dim_ordering": "tf", "W_constraint": null, "subsample": [2, 2], "b_regularizer": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"bias": true, "nb_col": 3, "W_regularizer": null, "activation": "linear", "nb_row": 3, "name": "convolution2d_5", "border_mode": "same", "b_constraint": null, "nb_filter": 64, "dim_ordering": "tf", "W_constraint": null, "subsample": [1, 1], "b_regularizer": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"bias": true, "nb_col": 3, "W_regularizer": null, "activation": "linear", "nb_row": 3, "name": "convolution2d_6", "border_mode": "same", "b_constraint": null, "nb_filter": 64, "dim_ordering": "tf", "W_constraint": null, "subsample": [1, 1], "b_regularizer": null, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"bias": true, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "name": "dense_1", "b_constraint": null, "input_dim": null, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "output_dim": 100}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"bias": true, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "name": "dense_2", "b_constraint": null, "input_dim": null, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "output_dim": 50}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"bias": true, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "name": "dense_3", "b_constraint": null, "input_dim": null, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}