{"config": [{"config": {"batch_input_shape": [null, 44, 160, 3], "output_shape": [44, 160, 3], "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-19-19a9f5c753a5>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "arguments": {}, "input_dtype": "float32", "output_shape_type": "raw", "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"border_mode": "same", "b_constraint": null, "nb_row": 1, "name": "convolution2d_1", "nb_col": 1, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "activation": "linear", "nb_filter": 3, "bias": true}, "class_name": "Convolution2D"}, {"config": {"border_mode": "same", "b_constraint": null, "nb_row": 5, "name": "convolution2d_2", "nb_col": 5, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "subsample": [2, 2], "activation": "linear", "nb_filter": 24, "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"border_mode": "same", "b_constraint": null, "nb_row": 5, "name": "convolution2d_3", "nb_col": 5, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "subsample": [2, 2], "activation": "linear", "nb_filter": 36, "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"border_mode": "same", "b_constraint": null, "nb_row": 5, "name": "convolution2d_4", "nb_col": 5, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "subsample": [2, 2], "activation": "linear", "nb_filter": 48, "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"border_mode": "same", "b_constraint": null, "nb_row": 3, "name": "convolution2d_5", "nb_col": 3, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "activation": "linear", "nb_filter": 64, "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"border_mode": "same", "b_constraint": null, "nb_row": 3, "name": "convolution2d_6", "nb_col": 3, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "activation": "linear", "nb_filter": 64, "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_constraint": null, "input_dim": null, "name": "dense_1", "W_constraint": null, "output_dim": 100, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "activation": "linear", "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_6", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_constraint": null, "input_dim": null, "name": "dense_2", "W_constraint": null, "output_dim": 50, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "activation": "linear", "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_7", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_constraint": null, "input_dim": null, "name": "dense_3", "W_constraint": null, "output_dim": 1, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "activation": "linear", "bias": true}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}