{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"trainable": true, "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-18-1872f279606c>\u00da\b<lambda>\u0005\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "output_shape": [40, 160, 3], "batch_input_shape": [null, 40, 160, 3], "input_dtype": "float32", "arguments": {}, "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "trainable": true, "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "he_normal", "dim_ordering": "tf", "nb_filter": 32, "activity_regularizer": null, "name": "conv1", "border_mode": "valid", "bias": true, "b_constraint": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "trainable": true, "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "he_normal", "dim_ordering": "tf", "nb_filter": 32, "activity_regularizer": null, "name": "conv2", "border_mode": "valid", "bias": true, "b_constraint": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "trainable": true, "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "he_normal", "dim_ordering": "tf", "nb_filter": 64, "activity_regularizer": null, "name": "conv3", "border_mode": "valid", "bias": true, "b_constraint": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "trainable": true, "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "he_normal", "dim_ordering": "tf", "nb_filter": 64, "activity_regularizer": null, "name": "conv4", "border_mode": "valid", "bias": true, "b_constraint": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_2", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "trainable": true, "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "he_normal", "dim_ordering": "tf", "nb_filter": 128, "activity_regularizer": null, "name": "conv5", "border_mode": "valid", "bias": true, "b_constraint": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "trainable": true, "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "he_normal", "dim_ordering": "tf", "nb_filter": 128, "activity_regularizer": null, "name": "conv6", "border_mode": "valid", "bias": true, "b_constraint": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_3", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "W_regularizer": null, "W_constraint": null, "output_dim": 512, "input_dim": null, "b_regularizer": null, "init": "he_normal", "activity_regularizer": null, "name": "hidden1", "bias": true, "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "W_regularizer": null, "W_constraint": null, "output_dim": 64, "input_dim": null, "b_regularizer": null, "init": "he_normal", "activity_regularizer": null, "name": "hidden2", "bias": true, "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "W_regularizer": null, "W_constraint": null, "output_dim": 16, "input_dim": null, "b_regularizer": null, "init": "he_normal", "activity_regularizer": null, "name": "hidden3", "bias": true, "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_9", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "W_regularizer": null, "W_constraint": null, "output_dim": 1, "input_dim": null, "b_regularizer": null, "init": "he_normal", "activity_regularizer": null, "name": "output", "bias": true, "b_constraint": null}}]}