{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"trainable": true, "output_shape_type": "raw", "batch_input_shape": [null, 40, 160, 3], "name": "lambda_1", "output_shape": [40, 160, 3], "arguments": {}, "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-19-1872f279606c>\u00da\b<lambda>\u0005\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "nb_col": 3, "nb_row": 3, "dim_ordering": "tf", "bias": true, "subsample": [1, 1], "trainable": true, "border_mode": "valid", "nb_filter": 32, "activity_regularizer": null, "b_constraint": null, "name": "conv1", "init": "he_normal", "activation": "linear", "b_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "nb_col": 3, "nb_row": 3, "dim_ordering": "tf", "bias": true, "subsample": [1, 1], "trainable": true, "border_mode": "valid", "nb_filter": 32, "activity_regularizer": null, "b_constraint": null, "name": "conv2", "init": "he_normal", "activation": "linear", "b_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "nb_col": 3, "nb_row": 3, "dim_ordering": "tf", "bias": true, "subsample": [1, 1], "trainable": true, "border_mode": "valid", "nb_filter": 64, "activity_regularizer": null, "b_constraint": null, "name": "conv3", "init": "he_normal", "activation": "linear", "b_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "nb_col": 3, "nb_row": 3, "dim_ordering": "tf", "bias": true, "subsample": [1, 1], "trainable": true, "border_mode": "valid", "nb_filter": 64, "activity_regularizer": null, "b_constraint": null, "name": "conv4", "init": "he_normal", "activation": "linear", "b_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_2", "pool_size": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "nb_col": 3, "nb_row": 3, "dim_ordering": "tf", "bias": true, "subsample": [1, 1], "trainable": true, "border_mode": "valid", "nb_filter": 128, "activity_regularizer": null, "b_constraint": null, "name": "conv5", "init": "he_normal", "activation": "linear", "b_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "nb_col": 3, "nb_row": 3, "dim_ordering": "tf", "bias": true, "subsample": [1, 1], "trainable": true, "border_mode": "valid", "nb_filter": 128, "activity_regularizer": null, "b_constraint": null, "name": "conv6", "init": "he_normal", "activation": "linear", "b_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_3", "pool_size": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "output_dim": 512, "b_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "activity_regularizer": null, "b_constraint": null, "name": "hidden1", "init": "he_normal", "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "output_dim": 64, "b_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "activity_regularizer": null, "b_constraint": null, "name": "hidden2", "init": "he_normal", "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_5"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "output_dim": 16, "b_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "activity_regularizer": null, "b_constraint": null, "name": "hidden3", "init": "he_normal", "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_9"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "W_constraint": null, "output_dim": 1, "b_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "activity_regularizer": null, "b_constraint": null, "name": "output", "init": "he_normal", "activation": "linear"}}]}