{"config": [{"config": {"input_dtype": "float32", "batch_input_shape": [null, 44, 160, 3], "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-18-9a71d7a5ea64>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "function_type": "lambda", "trainable": true, "output_shape": [44, 160, 3], "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"activity_regularizer": null, "subsample": [4, 4], "init": "glorot_uniform", "dim_ordering": "tf", "W_constraint": null, "b_constraint": null, "trainable": true, "bias": true, "nb_col": 5, "W_regularizer": null, "nb_row": 5, "border_mode": "same", "activation": "linear", "name": "convolution2d_1", "nb_filter": 16, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "dim_ordering": "tf", "W_constraint": null, "b_constraint": null, "trainable": true, "bias": true, "nb_col": 3, "W_regularizer": null, "nb_row": 3, "border_mode": "same", "activation": "linear", "name": "convolution2d_2", "nb_filter": 32, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "dim_ordering": "tf", "W_constraint": null, "b_constraint": null, "trainable": true, "bias": true, "nb_col": 3, "W_regularizer": null, "nb_row": 3, "border_mode": "same", "activation": "linear", "name": "convolution2d_3", "nb_filter": 64, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "trainable": true, "bias": true, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "name": "dense_1", "output_dim": 512}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "trainable": true, "bias": true, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "name": "dense_2", "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}