{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"b_constraint": null, "activation": "linear", "border_mode": "same", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "nb_col": 5, "W_constraint": null, "trainable": true, "batch_input_shape": [null, 48, 160, 1], "b_regularizer": null, "nb_row": 5, "subsample": [4, 4], "bias": true, "nb_filter": 24, "name": "convolution2d_1", "dim_ordering": "tf", "input_dtype": "float32"}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "activation": "linear", "border_mode": "same", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "nb_col": 5, "trainable": true, "W_constraint": null, "b_regularizer": null, "nb_row": 5, "subsample": [2, 2], "bias": true, "nb_filter": 36, "name": "convolution2d_2", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "activation": "linear", "border_mode": "same", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "nb_col": 5, "trainable": true, "W_constraint": null, "b_regularizer": null, "nb_row": 5, "subsample": [2, 2], "bias": true, "nb_filter": 48, "name": "convolution2d_3", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "activation": "linear", "border_mode": "same", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "nb_col": 3, "trainable": true, "W_constraint": null, "b_regularizer": null, "nb_row": 3, "subsample": [2, 2], "bias": true, "nb_filter": 64, "name": "convolution2d_4", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "activation": "linear", "border_mode": "same", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "nb_col": 3, "trainable": true, "W_constraint": null, "b_regularizer": null, "nb_row": 3, "subsample": [2, 2], "bias": true, "nb_filter": 64, "name": "convolution2d_5", "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.4}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "output_dim": 100, "bias": true, "init": "glorot_uniform", "name": "dense_1", "input_dim": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.4}}, {"class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "output_dim": 50, "bias": true, "init": "glorot_uniform", "name": "dense_2", "input_dim": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.4}}, {"class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "linear", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "output_dim": 1, "bias": true, "init": "glorot_uniform", "name": "dense_3", "input_dim": null}}], "keras_version": "1.1.2"}