{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "output_shape": [40, 160, 3], "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-19-1872f279606c>\u00da\b<lambda>\u0005\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "arguments": {}, "batch_input_shape": [null, 40, 160, 3], "name": "lambda_1", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "init": "he_normal", "subsample": [1, 1], "activation": "linear", "b_constraint": null, "name": "conv1", "W_regularizer": null, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "trainable": true, "nb_col": 3, "nb_row": 3, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "init": "he_normal", "subsample": [1, 1], "activation": "linear", "b_constraint": null, "name": "conv2", "W_regularizer": null, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "trainable": true, "nb_col": 3, "nb_row": 3, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "init": "he_normal", "subsample": [1, 1], "activation": "linear", "b_constraint": null, "name": "conv3", "W_regularizer": null, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "trainable": true, "nb_col": 3, "nb_row": 3, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "init": "he_normal", "subsample": [1, 1], "activation": "linear", "b_constraint": null, "name": "conv4", "W_regularizer": null, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "trainable": true, "nb_col": 3, "nb_row": 3, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_filter": 128, "init": "he_normal", "subsample": [1, 1], "activation": "linear", "b_constraint": null, "name": "conv5", "W_regularizer": null, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "trainable": true, "nb_col": 3, "nb_row": 3, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 128, "init": "he_normal", "subsample": [1, 1], "activation": "linear", "b_constraint": null, "name": "conv6", "W_regularizer": null, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "trainable": true, "nb_col": 3, "nb_row": 3, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "activation": "linear", "activity_regularizer": null, "output_dim": 512, "name": "hidden1", "init": "he_normal", "W_regularizer": null, "b_regularizer": null, "trainable": true, "input_dim": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.5}}, {"class_name": "Dense", "config": {"bias": true, "activation": "linear", "activity_regularizer": null, "output_dim": 64, "name": "hidden2", "init": "he_normal", "W_regularizer": null, "b_regularizer": null, "trainable": true, "input_dim": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "p": 0.5}}, {"class_name": "Dense", "config": {"bias": true, "activation": "linear", "activity_regularizer": null, "output_dim": 16, "name": "hidden3", "init": "he_normal", "W_regularizer": null, "b_regularizer": null, "trainable": true, "input_dim": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_9"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "p": 0.5}}, {"class_name": "Dense", "config": {"bias": true, "activation": "linear", "activity_regularizer": null, "output_dim": 1, "name": "output", "init": "he_normal", "W_regularizer": null, "b_regularizer": null, "trainable": true, "input_dim": null, "W_constraint": null, "b_constraint": null}}]}