{"keras_version": "1.1.2", "config": [{"config": {"name": "convolution2d_1", "nb_col": 8, "border_mode": "same", "init": "glorot_uniform", "batch_input_shape": [null, 80, 160, 1], "nb_filter": 16, "trainable": true, "activation": "linear", "W_constraint": null, "b_regularizer": null, "dim_ordering": "tf", "input_dtype": "float32", "activity_regularizer": null, "bias": true, "b_constraint": null, "W_regularizer": null, "subsample": [4, 4], "nb_row": 8}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "convolution2d_2", "nb_col": 5, "border_mode": "same", "init": "glorot_uniform", "nb_filter": 32, "trainable": true, "activation": "linear", "W_constraint": null, "b_regularizer": null, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "subsample": [2, 2], "W_regularizer": null, "b_constraint": null, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "convolution2d_3", "nb_col": 5, "border_mode": "same", "init": "glorot_uniform", "nb_filter": 64, "trainable": true, "activation": "linear", "W_constraint": null, "b_regularizer": null, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "subsample": [2, 2], "W_regularizer": null, "b_constraint": null, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"output_dim": 512, "name": "dense_1", "input_dim": null, "init": "glorot_uniform", "trainable": true, "activation": "linear", "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "bias": true, "b_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"output_dim": 1, "name": "dense_2", "input_dim": null, "init": "glorot_uniform", "trainable": true, "activation": "linear", "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "bias": true, "b_constraint": null, "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}