{"keras_version": "1.1.2", "config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-19-1872f279606c>\u00da\b<lambda>\u0005\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 40, 160, 3], "output_shape": [40, 160, 3], "trainable": true, "input_dtype": "float32", "name": "lambda_1", "output_shape_type": "raw", "function_type": "lambda", "arguments": {}}, "class_name": "Lambda"}, {"config": {"nb_row": 3, "dim_ordering": "tf", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_col": 3, "name": "conv1", "activity_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "activation": "linear", "init": "he_normal", "W_constraint": null, "b_constraint": null, "trainable": true, "nb_filter": 32}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"nb_row": 3, "dim_ordering": "tf", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_col": 3, "name": "conv2", "activity_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "activation": "linear", "init": "he_normal", "W_constraint": null, "b_constraint": null, "trainable": true, "nb_filter": 32}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"nb_row": 3, "dim_ordering": "tf", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_col": 3, "name": "conv3", "activity_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "activation": "linear", "init": "he_normal", "W_constraint": null, "b_constraint": null, "trainable": true, "nb_filter": 64}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"nb_row": 3, "dim_ordering": "tf", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_col": 3, "name": "conv4", "activity_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "activation": "linear", "init": "he_normal", "W_constraint": null, "b_constraint": null, "trainable": true, "nb_filter": 64}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_2", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"nb_row": 3, "dim_ordering": "tf", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_col": 3, "name": "conv5", "activity_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "activation": "linear", "init": "he_normal", "W_constraint": null, "b_constraint": null, "trainable": true, "nb_filter": 128}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"nb_row": 3, "dim_ordering": "tf", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_col": 3, "name": "conv6", "activity_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "activation": "linear", "init": "he_normal", "W_constraint": null, "b_constraint": null, "trainable": true, "nb_filter": 128}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_3", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "hidden1", "b_constraint": null, "b_regularizer": null, "output_dim": 512, "activity_regularizer": null, "W_constraint": null, "init": "he_normal", "bias": true, "input_dim": null, "trainable": true, "activation": "linear", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"name": "dropout_4", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "hidden2", "b_constraint": null, "b_regularizer": null, "output_dim": 64, "activity_regularizer": null, "W_constraint": null, "init": "he_normal", "bias": true, "input_dim": null, "trainable": true, "activation": "linear", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}, "class_name": "ELU"}, {"config": {"name": "dropout_5", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "hidden3", "b_constraint": null, "b_regularizer": null, "output_dim": 16, "activity_regularizer": null, "W_constraint": null, "init": "he_normal", "bias": true, "input_dim": null, "trainable": true, "activation": "linear", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_9"}, "class_name": "ELU"}, {"config": {"name": "dropout_6", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "output", "b_constraint": null, "b_regularizer": null, "output_dim": 1, "activity_regularizer": null, "W_constraint": null, "init": "he_normal", "bias": true, "input_dim": null, "trainable": true, "activation": "linear", "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}