{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-18-9a71d7a5ea64>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": [32, 160, 3], "batch_input_shape": [null, 32, 160, 3], "arguments": {}, "name": "lambda_1", "output_shape_type": "raw", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "dim_ordering": "tf", "name": "convolution2d_1", "init": "glorot_uniform", "nb_col": 5, "bias": true, "b_constraint": null, "W_regularizer": null, "trainable": true, "nb_filter": 16, "activation": "linear", "nb_row": 5, "subsample": [4, 4], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "dim_ordering": "tf", "name": "convolution2d_2", "init": "glorot_uniform", "nb_col": 3, "bias": true, "b_constraint": null, "W_regularizer": null, "trainable": true, "nb_filter": 32, "activation": "linear", "nb_row": 3, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "dim_ordering": "tf", "name": "convolution2d_3", "init": "glorot_uniform", "nb_col": 3, "bias": true, "b_constraint": null, "W_regularizer": null, "trainable": true, "nb_filter": 64, "activation": "linear", "nb_row": 3, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "linear", "name": "dense_1", "bias": true, "b_constraint": null, "input_dim": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "output_dim": 512, "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "linear", "name": "dense_2", "bias": true, "b_constraint": null, "input_dim": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "output_dim": 1, "b_regularizer": null, "init": "glorot_uniform"}}]}