{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "batch_input_shape": [null, 44, 160, 3], "name": "lambda_1", "output_shape_type": "raw", "function_type": "lambda", "trainable": true, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-19-19a9f5c753a5>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": [44, 160, 3]}}, {"class_name": "Convolution2D", "config": {"nb_row": 1, "W_regularizer": null, "name": "convolution2d_1", "nb_col": 1, "activity_regularizer": null, "trainable": true, "bias": true, "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "border_mode": "same", "nb_filter": 3, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "W_regularizer": null, "name": "convolution2d_2", "nb_col": 5, "activity_regularizer": null, "trainable": true, "bias": true, "subsample": [2, 2], "W_constraint": null, "b_regularizer": null, "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "border_mode": "same", "nb_filter": 24, "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "W_regularizer": null, "name": "convolution2d_3", "nb_col": 5, "activity_regularizer": null, "trainable": true, "bias": true, "subsample": [2, 2], "W_constraint": null, "b_regularizer": null, "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "border_mode": "same", "nb_filter": 36, "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "W_regularizer": null, "name": "convolution2d_4", "nb_col": 5, "activity_regularizer": null, "trainable": true, "bias": true, "subsample": [2, 2], "W_constraint": null, "b_regularizer": null, "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "border_mode": "same", "nb_filter": 48, "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "W_regularizer": null, "name": "convolution2d_5", "nb_col": 3, "activity_regularizer": null, "trainable": true, "bias": true, "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "border_mode": "same", "nb_filter": 64, "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "W_regularizer": null, "name": "convolution2d_6", "nb_col": 3, "activity_regularizer": null, "trainable": true, "bias": true, "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "border_mode": "same", "nb_filter": 64, "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Dense", "config": {"output_dim": 100, "name": "dense_1", "activity_regularizer": null, "trainable": true, "W_regularizer": null, "bias": true, "W_constraint": null, "b_regularizer": null, "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "input_dim": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}}, {"class_name": "Dense", "config": {"output_dim": 50, "name": "dense_2", "activity_regularizer": null, "trainable": true, "W_regularizer": null, "bias": true, "W_constraint": null, "b_regularizer": null, "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "input_dim": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}}, {"class_name": "Dense", "config": {"output_dim": 1, "name": "dense_3", "activity_regularizer": null, "trainable": true, "W_regularizer": null, "bias": true, "W_constraint": null, "b_regularizer": null, "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "input_dim": null}}], "keras_version": "1.1.2"}