{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"subsample": [2, 2], "input_dtype": "float32", "W_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "trainable": true, "nb_filter": 24, "dim_ordering": "tf", "activation": "linear", "nb_row": 3, "nb_col": 3, "name": "convolution2d_1", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "bias": true, "batch_input_shape": [null, 44, 160, 3], "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "W_regularizer": null, "border_mode": "same", "trainable": true, "nb_filter": 36, "dim_ordering": "tf", "activation": "linear", "b_regularizer": null, "nb_col": 3, "name": "convolution2d_2", "b_constraint": null, "nb_row": 3, "W_constraint": null, "bias": true, "init": "glorot_uniform", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_regularizer": null, "border_mode": "same", "trainable": true, "nb_filter": 48, "dim_ordering": "tf", "activation": "linear", "b_regularizer": null, "nb_col": 3, "name": "convolution2d_3", "b_constraint": null, "nb_row": 3, "W_constraint": null, "bias": true, "init": "glorot_uniform", "activity_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.4, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "output_dim": 100, "W_regularizer": null, "trainable": true, "activation": "linear", "b_regularizer": null, "b_constraint": null, "name": "dense_1", "W_constraint": null, "bias": true, "init": "glorot_uniform", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.4, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "output_dim": 50, "W_regularizer": null, "trainable": true, "activation": "linear", "b_regularizer": null, "b_constraint": null, "name": "dense_2", "W_constraint": null, "bias": true, "init": "glorot_uniform", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.4, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "output_dim": 1, "W_regularizer": null, "trainable": true, "activation": "linear", "b_regularizer": null, "b_constraint": null, "name": "dense_3", "W_constraint": null, "bias": true, "init": "glorot_uniform", "activity_regularizer": null}}]}