{"config": [{"config": {"function_type": "lambda", "arguments": {}, "batch_input_shape": [null, 44, 160, 3], "output_shape": [44, 160, 3], "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-36-3924845f998b>\u00da\b<lambda>\u0002\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "output_shape_type": "raw", "trainable": true}, "class_name": "Lambda"}, {"config": {"bias": true, "nb_col": 1, "nb_filter": 3, "name": "convolution2d_1", "nb_row": 1, "W_constraint": null, "b_regularizer": null, "subsample": [4, 4], "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "b_constraint": null, "activation": "linear", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"bias": true, "nb_col": 8, "nb_filter": 16, "name": "convolution2d_2", "nb_row": 8, "W_constraint": null, "b_regularizer": null, "subsample": [4, 4], "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "b_constraint": null, "activation": "linear", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"bias": true, "nb_col": 5, "nb_filter": 32, "name": "convolution2d_3", "nb_row": 5, "W_constraint": null, "b_regularizer": null, "subsample": [2, 2], "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "b_constraint": null, "activation": "linear", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"bias": true, "nb_col": 5, "nb_filter": 64, "name": "convolution2d_4", "nb_row": 5, "W_constraint": null, "b_regularizer": null, "subsample": [2, 2], "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "b_constraint": null, "activation": "linear", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"bias": true, "output_dim": 512, "name": "dense_1", "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "activation": "linear", "trainable": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"bias": true, "output_dim": 1, "name": "dense_2", "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "activation": "linear", "trainable": true, "W_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}