{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_13", "activity_regularizer": null, "batch_input_shape": [null, 12800], "b_constraint": null, "W_regularizer": null, "trainable": true, "activation": "linear", "W_constraint": null, "input_dtype": "float32", "bias": true, "output_dim": 128, "init": "glorot_uniform", "input_dim": 12800}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_14", "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "activation": "linear", "bias": true, "output_dim": 1, "init": "glorot_uniform", "input_dim": null}}], "keras_version": "1.1.2"}