{"config": [{"config": {"trainable": true, "nb_col": 5, "nb_filter": 24, "b_regularizer": null, "activation": "linear", "bias": true, "dim_ordering": "tf", "border_mode": "same", "input_dtype": "float32", "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "subsample": [2, 2], "W_constraint": null, "batch_input_shape": [null, 48, 160, 1], "name": "convolution2d_1", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"trainable": true, "nb_col": 5, "nb_filter": 36, "activation": "linear", "b_regularizer": null, "bias": true, "dim_ordering": "tf", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "subsample": [2, 2], "W_constraint": null, "name": "convolution2d_2", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"trainable": true, "nb_col": 5, "nb_filter": 48, "activation": "linear", "b_regularizer": null, "bias": true, "dim_ordering": "tf", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "subsample": [2, 2], "W_constraint": null, "name": "convolution2d_3", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"trainable": true, "nb_col": 3, "nb_filter": 64, "activation": "linear", "b_regularizer": null, "bias": true, "dim_ordering": "tf", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "subsample": [1, 1], "W_constraint": null, "name": "convolution2d_4", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"trainable": true, "nb_col": 3, "nb_filter": 64, "activation": "linear", "b_regularizer": null, "bias": true, "dim_ordering": "tf", "border_mode": "same", "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "subsample": [1, 1], "W_constraint": null, "name": "convolution2d_5", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "p": 0.4, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"trainable": true, "W_constraint": null, "activation": "linear", "bias": true, "output_dim": 100, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "input_dim": null, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.4, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"trainable": true, "W_constraint": null, "activation": "linear", "bias": true, "output_dim": 50, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "input_dim": null, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.4, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"trainable": true, "W_constraint": null, "activation": "linear", "bias": true, "output_dim": 1, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "name": "dense_3", "input_dim": null, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}