{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-19-19a9f5c753a5>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "name": "lambda_1", "arguments": {}, "batch_input_shape": [null, 44, 160, 3], "function_type": "lambda", "input_dtype": "float32", "output_shape": [44, 160, 3], "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 3, "activation": "linear", "name": "convolution2d_1", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "border_mode": "same", "trainable": true, "nb_row": 1, "subsample": [1, 1], "dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "nb_col": 1}}, {"class_name": "Convolution2D", "config": {"nb_filter": 24, "activation": "linear", "name": "convolution2d_2", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "border_mode": "same", "trainable": true, "nb_row": 5, "subsample": [2, 2], "dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "nb_col": 5}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "activation": "linear", "name": "convolution2d_3", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "border_mode": "same", "trainable": true, "nb_row": 5, "subsample": [2, 2], "dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "nb_col": 5}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "activation": "linear", "name": "convolution2d_4", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "border_mode": "same", "trainable": true, "nb_row": 5, "subsample": [2, 2], "dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "nb_col": 5}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "activation": "linear", "name": "convolution2d_5", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "border_mode": "same", "trainable": true, "nb_row": 3, "subsample": [1, 1], "dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "nb_col": 3}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "activation": "linear", "name": "convolution2d_6", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "border_mode": "same", "trainable": true, "nb_row": 3, "subsample": [1, 1], "dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "nb_col": 3}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_1", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "trainable": true, "output_dim": 100, "b_regularizer": null, "W_constraint": null, "input_dim": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_2", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "trainable": true, "output_dim": 50, "b_regularizer": null, "W_constraint": null, "input_dim": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_3", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "trainable": true, "output_dim": 1, "b_regularizer": null, "W_constraint": null, "input_dim": null}}]}