{"keras_version": "1.1.2", "config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-18-4d594577c7ec>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape_type": "raw", "input_dtype": "float32", "arguments": {}, "name": "lambda_1", "batch_input_shape": [null, 44, 160, 3], "trainable": true, "output_shape": [44, 160, 3]}, "class_name": "Lambda"}, {"config": {"nb_filter": 24, "trainable": true, "W_constraint": null, "b_constraint": null, "dim_ordering": "tf", "activation": "linear", "bias": true, "init": "glorot_uniform", "subsample": [2, 2], "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "name": "convolution2d_1", "nb_row": 5, "nb_col": 5, "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"nb_filter": 36, "trainable": true, "W_constraint": null, "b_constraint": null, "dim_ordering": "tf", "activation": "linear", "bias": true, "init": "glorot_uniform", "subsample": [2, 2], "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "name": "convolution2d_2", "nb_row": 5, "nb_col": 5, "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"nb_filter": 48, "trainable": true, "W_constraint": null, "b_constraint": null, "dim_ordering": "tf", "activation": "linear", "bias": true, "init": "glorot_uniform", "subsample": [2, 2], "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "name": "convolution2d_3", "nb_row": 5, "nb_col": 5, "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"nb_filter": 64, "trainable": true, "W_constraint": null, "b_constraint": null, "dim_ordering": "tf", "activation": "linear", "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "name": "convolution2d_4", "nb_row": 3, "nb_col": 3, "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"nb_filter": 64, "trainable": true, "W_constraint": null, "b_constraint": null, "dim_ordering": "tf", "activation": "linear", "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "name": "convolution2d_5", "nb_row": 3, "nb_col": 3, "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"b_constraint": null, "trainable": true, "W_constraint": null, "output_dim": 100, "activation": "linear", "bias": true, "init": "glorot_uniform", "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "name": "dense_1", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"b_constraint": null, "trainable": true, "W_constraint": null, "output_dim": 50, "activation": "linear", "bias": true, "init": "glorot_uniform", "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "name": "dense_2", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"b_constraint": null, "trainable": true, "W_constraint": null, "output_dim": 1, "activation": "linear", "bias": true, "init": "glorot_uniform", "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "name": "dense_3", "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}