{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "init": "glorot_uniform", "subsample": [2, 2], "batch_input_shape": [null, 44, 160, 3], "bias": true, "name": "convolution2d_1", "border_mode": "same", "nb_col": 3, "b_regularizer": null, "input_dtype": "float32", "nb_filter": 24, "nb_row": 3, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"trainable": true, "subsample": [2, 2], "nb_row": 3, "bias": true, "name": "convolution2d_2", "border_mode": "same", "nb_col": 3, "b_regularizer": null, "nb_filter": 36, "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"trainable": true, "subsample": [1, 1], "nb_row": 3, "bias": true, "name": "convolution2d_3", "border_mode": "same", "nb_col": 3, "b_regularizer": null, "nb_filter": 48, "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.4}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "name": "dense_1", "b_regularizer": null, "output_dim": 100, "input_dim": null, "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.4}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "name": "dense_2", "b_regularizer": null, "output_dim": 50, "input_dim": null, "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.4}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "name": "dense_3", "b_regularizer": null, "output_dim": 1, "input_dim": null, "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null}}]}