{"keras_version": "1.1.2", "config": [{"config": {"input_dtype": "float32", "batch_input_shape": [null, 44, 160, 3], "function_type": "lambda", "arguments": {}, "output_shape": [44, 160, 3], "output_shape_type": "raw", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-19-19a9f5c753a5>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true}, "class_name": "Lambda"}, {"config": {"border_mode": "same", "subsample": [1, 1], "trainable": true, "nb_filter": 3, "nb_col": 1, "b_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "b_constraint": null, "name": "convolution2d_1", "init": "glorot_uniform", "nb_row": 1}, "class_name": "Convolution2D"}, {"config": {"border_mode": "same", "subsample": [2, 2], "trainable": true, "nb_filter": 24, "nb_col": 5, "b_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "b_constraint": null, "name": "convolution2d_2", "init": "glorot_uniform", "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"border_mode": "same", "subsample": [2, 2], "trainable": true, "nb_filter": 36, "nb_col": 5, "b_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "b_constraint": null, "name": "convolution2d_3", "init": "glorot_uniform", "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"border_mode": "same", "subsample": [2, 2], "trainable": true, "nb_filter": 48, "nb_col": 5, "b_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "b_constraint": null, "name": "convolution2d_4", "init": "glorot_uniform", "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"border_mode": "same", "subsample": [1, 1], "trainable": true, "nb_filter": 64, "nb_col": 3, "b_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "b_constraint": null, "name": "convolution2d_5", "init": "glorot_uniform", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"border_mode": "same", "subsample": [1, 1], "trainable": true, "nb_filter": 64, "nb_col": 3, "b_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "b_constraint": null, "name": "convolution2d_6", "init": "glorot_uniform", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"output_dim": 100, "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "input_dim": null, "init": "glorot_uniform", "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"output_dim": 50, "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "input_dim": null, "init": "glorot_uniform", "name": "dense_2"}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"output_dim": 1, "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "input_dim": null, "init": "glorot_uniform", "name": "dense_3"}, "class_name": "Dense"}], "class_name": "Sequential"}