{"keras_version": "1.1.2", "config": [{"config": {"b_constraint": null, "batch_input_shape": [null, 56, 160, 1], "nb_col": 5, "input_dtype": "float32", "trainable": true, "name": "convolution2d_1", "subsample": [4, 4], "activation": "linear", "W_regularizer": null, "nb_filter": 24, "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"b_constraint": null, "nb_col": 5, "dim_ordering": "tf", "trainable": true, "name": "convolution2d_2", "subsample": [2, 2], "activation": "linear", "W_regularizer": null, "nb_filter": 36, "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "nb_row": 5, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"b_constraint": null, "nb_col": 5, "dim_ordering": "tf", "trainable": true, "name": "convolution2d_3", "subsample": [2, 2], "activation": "linear", "W_regularizer": null, "nb_filter": 48, "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "nb_row": 5, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"b_constraint": null, "nb_col": 3, "dim_ordering": "tf", "trainable": true, "name": "convolution2d_4", "subsample": [2, 2], "activation": "linear", "W_regularizer": null, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "nb_row": 3, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"b_constraint": null, "nb_col": 3, "dim_ordering": "tf", "trainable": true, "name": "convolution2d_5", "subsample": [2, 2], "activation": "linear", "W_regularizer": null, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "bias": true, "activity_regularizer": null, "nb_row": 3, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "p": 0.4, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "trainable": true, "name": "dense_1", "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "bias": true, "b_regularizer": null, "output_dim": 100, "W_constraint": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.4, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "trainable": true, "name": "dense_2", "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "bias": true, "b_regularizer": null, "output_dim": 50, "W_constraint": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.4, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "trainable": true, "name": "dense_3", "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "bias": true, "b_regularizer": null, "output_dim": 1, "W_constraint": null, "input_dim": null}, "class_name": "Dense"}], "class_name": "Sequential"}