{"keras_version": "1.1.2", "config": [{"config": {"input_dtype": "float32", "name": "lambda_1", "trainable": true, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-18-19a9f5c753a5>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape": [44, 160, 3], "output_shape_type": "raw", "batch_input_shape": [null, 44, 160, 3]}, "class_name": "Lambda"}, {"config": {"b_regularizer": null, "trainable": true, "nb_filter": 3, "border_mode": "same", "name": "convolution2d_1", "bias": true, "nb_row": 1, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "subsample": [1, 1], "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "trainable": true, "nb_filter": 24, "border_mode": "same", "name": "convolution2d_2", "bias": true, "nb_row": 5, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_col": 5, "init": "glorot_uniform", "activation": "linear", "subsample": [2, 2], "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "trainable": true, "nb_filter": 36, "border_mode": "same", "name": "convolution2d_3", "bias": true, "nb_row": 5, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_col": 5, "init": "glorot_uniform", "activation": "linear", "subsample": [2, 2], "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "trainable": true, "nb_filter": 48, "border_mode": "same", "name": "convolution2d_4", "bias": true, "nb_row": 5, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_col": 5, "init": "glorot_uniform", "activation": "linear", "subsample": [2, 2], "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "trainable": true, "nb_filter": 64, "border_mode": "same", "name": "convolution2d_5", "bias": true, "nb_row": 3, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "subsample": [1, 1], "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "trainable": true, "nb_filter": 64, "border_mode": "same", "name": "convolution2d_6", "bias": true, "nb_row": 3, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "subsample": [1, 1], "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "name": "dense_1", "W_constraint": null, "W_regularizer": null, "output_dim": 100, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_6", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "name": "dense_2", "W_constraint": null, "W_regularizer": null, "output_dim": 50, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_7", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "trainable": true, "bias": true, "input_dim": null, "name": "dense_3", "W_constraint": null, "W_regularizer": null, "output_dim": 1, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}