{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "nb_col": 1, "bias": true, "activation": "linear", "activity_regularizer": null, "input_dtype": "float32", "b_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "b_constraint": null, "nb_filter": 3, "init": "glorot_uniform", "subsample": [2, 2], "nb_row": 1, "batch_input_shape": [null, 44, 160, 3], "name": "convolution2d_1", "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "nb_col": 3, "bias": true, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "b_constraint": null, "nb_filter": 24, "init": "glorot_uniform", "subsample": [2, 2], "nb_row": 3, "name": "convolution2d_2", "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "nb_col": 3, "bias": true, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "b_constraint": null, "nb_filter": 36, "init": "glorot_uniform", "subsample": [2, 2], "nb_row": 3, "name": "convolution2d_3", "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "nb_col": 3, "bias": true, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "b_constraint": null, "nb_filter": 48, "init": "glorot_uniform", "subsample": [1, 1], "nb_row": 3, "name": "convolution2d_4", "W_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.4, "name": "dropout_1"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Dense", "config": {"output_dim": 100, "trainable": true, "b_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "linear", "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "name": "dense_1", "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.4, "name": "dropout_2"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Dense", "config": {"output_dim": 50, "trainable": true, "b_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "linear", "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "name": "dense_2", "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.4, "name": "dropout_3"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Dense", "config": {"output_dim": 1, "trainable": true, "b_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "linear", "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "name": "dense_3", "W_regularizer": null}}], "keras_version": "1.1.2"}