{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "output_shape_type": "raw", "input_dtype": "float32", "batch_input_shape": [null, 44, 160, 3], "arguments": {}, "output_shape": [44, 160, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-31-b95e1e6772b2>\u00da\b<lambda>\u0002\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"nb_row": 8, "name": "convolution2d_1", "nb_filter": 16, "b_constraint": null, "dim_ordering": "tf", "bias": true, "W_constraint": null, "subsample": [4, 4], "activity_regularizer": null, "trainable": true, "nb_col": 8, "activation": "linear", "border_mode": "same", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "name": "convolution2d_2", "nb_filter": 32, "b_constraint": null, "dim_ordering": "tf", "bias": true, "W_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "trainable": true, "nb_col": 5, "activation": "linear", "border_mode": "same", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "name": "convolution2d_3", "nb_filter": 64, "b_constraint": null, "dim_ordering": "tf", "bias": true, "W_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "trainable": true, "nb_col": 5, "activation": "linear", "border_mode": "same", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"name": "dense_1", "b_constraint": null, "input_dim": null, "W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 512, "bias": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"name": "dense_2", "b_constraint": null, "input_dim": null, "W_constraint": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "bias": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform"}}]}