{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "nb_col": 5, "name": "convolution2d_26", "trainable": true, "init": "glorot_uniform", "batch_input_shape": [null, 80, 160, 1], "nb_filter": 24, "subsample": [4, 4], "W_constraint": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "border_mode": "same", "bias": true, "input_dtype": "float32", "nb_row": 5}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_36"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 5, "name": "convolution2d_27", "trainable": true, "init": "glorot_uniform", "nb_filter": 36, "subsample": [2, 2], "W_constraint": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "border_mode": "same", "bias": true, "b_constraint": null, "nb_row": 5}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_37"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 5, "name": "convolution2d_28", "trainable": true, "init": "glorot_uniform", "nb_filter": 48, "subsample": [2, 2], "W_constraint": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "border_mode": "same", "bias": true, "b_constraint": null, "nb_row": 5}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_38"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "name": "convolution2d_29", "trainable": true, "init": "glorot_uniform", "nb_filter": 64, "subsample": [2, 2], "W_constraint": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "border_mode": "same", "bias": true, "b_constraint": null, "nb_row": 3}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_39"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "name": "convolution2d_30", "trainable": true, "init": "glorot_uniform", "nb_filter": 64, "subsample": [2, 2], "W_constraint": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "border_mode": "same", "bias": true, "b_constraint": null, "nb_row": 3}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_6"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_16"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_40"}}, {"class_name": "Dense", "config": {"output_dim": 100, "name": "dense_16", "trainable": true, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "input_dim": null, "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_17"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_41"}}, {"class_name": "Dense", "config": {"output_dim": 50, "name": "dense_17", "trainable": true, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "input_dim": null, "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_18"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_42"}}, {"class_name": "Dense", "config": {"output_dim": 1, "name": "dense_18", "trainable": true, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "input_dim": null, "b_constraint": null}}]}