{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-19-19a9f5c753a5>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 44, 160, 3], "trainable": true, "input_dtype": "float32", "arguments": {}, "output_shape": [44, 160, 3], "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_regularizer": null, "subsample": [1, 1], "bias": true, "trainable": true, "b_constraint": null, "nb_filter": 3, "activation": "linear", "nb_row": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "b_regularizer": null, "nb_col": 1, "activity_regularizer": null, "name": "convolution2d_1"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_regularizer": null, "subsample": [2, 2], "bias": true, "trainable": true, "b_constraint": null, "nb_filter": 24, "activation": "linear", "nb_row": 5, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "b_regularizer": null, "nb_col": 5, "activity_regularizer": null, "name": "convolution2d_2"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_regularizer": null, "subsample": [2, 2], "bias": true, "trainable": true, "b_constraint": null, "nb_filter": 36, "activation": "linear", "nb_row": 5, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "b_regularizer": null, "nb_col": 5, "activity_regularizer": null, "name": "convolution2d_3"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_regularizer": null, "subsample": [2, 2], "bias": true, "trainable": true, "b_constraint": null, "nb_filter": 48, "activation": "linear", "nb_row": 5, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "b_regularizer": null, "nb_col": 5, "activity_regularizer": null, "name": "convolution2d_4"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_regularizer": null, "subsample": [1, 1], "bias": true, "trainable": true, "b_constraint": null, "nb_filter": 64, "activation": "linear", "nb_row": 3, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "b_regularizer": null, "nb_col": 3, "activity_regularizer": null, "name": "convolution2d_5"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_regularizer": null, "subsample": [1, 1], "bias": true, "trainable": true, "b_constraint": null, "nb_filter": 64, "activation": "linear", "nb_row": 3, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "b_regularizer": null, "nb_col": 3, "activity_regularizer": null, "name": "convolution2d_6"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Dense", "config": {"output_dim": 100, "W_regularizer": null, "bias": true, "trainable": true, "b_constraint": null, "activation": "linear", "init": "glorot_uniform", "input_dim": null, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "Dense", "config": {"output_dim": 50, "W_regularizer": null, "bias": true, "trainable": true, "b_constraint": null, "activation": "linear", "init": "glorot_uniform", "input_dim": null, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "name": "dense_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"class_name": "Dense", "config": {"output_dim": 1, "W_regularizer": null, "bias": true, "trainable": true, "b_constraint": null, "activation": "linear", "init": "glorot_uniform", "input_dim": null, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "name": "dense_3"}}]}