{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-19-1872f279606c>\u00da\b<lambda>\u0005\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "trainable": true, "name": "lambda_1", "batch_input_shape": [null, 40, 160, 3], "arguments": {}, "output_shape": [40, 160, 3], "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "W_regularizer": null, "trainable": true, "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "name": "conv1", "activation": "linear", "nb_filter": 32, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "bias": true, "border_mode": "valid", "subsample": [1, 1]}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "W_regularizer": null, "trainable": true, "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "name": "conv2", "activation": "linear", "nb_filter": 32, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "bias": true, "border_mode": "valid", "subsample": [1, 1]}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_1", "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "W_regularizer": null, "trainable": true, "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "name": "conv3", "activation": "linear", "nb_filter": 64, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "bias": true, "border_mode": "valid", "subsample": [1, 1]}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "W_regularizer": null, "trainable": true, "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "name": "conv4", "activation": "linear", "nb_filter": 64, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "bias": true, "border_mode": "valid", "subsample": [1, 1]}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_2", "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "W_regularizer": null, "trainable": true, "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "name": "conv5", "activation": "linear", "nb_filter": 128, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "bias": true, "border_mode": "valid", "subsample": [1, 1]}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "W_regularizer": null, "trainable": true, "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "name": "conv6", "activation": "linear", "nb_filter": 128, "nb_row": 3, "b_regularizer": null, "dim_ordering": "tf", "bias": true, "border_mode": "valid", "subsample": [1, 1]}}, {"class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_3", "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "output_dim": 512, "W_regularizer": null, "trainable": true, "W_constraint": null, "input_dim": null, "name": "hidden1", "activation": "linear", "b_regularizer": null, "bias": true, "init": "he_normal", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"b_constraint": null, "output_dim": 64, "W_regularizer": null, "trainable": true, "W_constraint": null, "input_dim": null, "name": "hidden2", "activation": "linear", "b_regularizer": null, "bias": true, "init": "he_normal", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"b_constraint": null, "output_dim": 16, "W_regularizer": null, "trainable": true, "W_constraint": null, "input_dim": null, "name": "hidden3", "activation": "linear", "b_regularizer": null, "bias": true, "init": "he_normal", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_9", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"b_constraint": null, "output_dim": 1, "W_regularizer": null, "trainable": true, "W_constraint": null, "input_dim": null, "name": "output", "activation": "linear", "b_regularizer": null, "bias": true, "init": "he_normal", "activity_regularizer": null}}]}