{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "output_shape_type": "raw", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-17-19a9f5c753a5>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 44, 160, 3], "input_dtype": "float32", "function_type": "lambda", "output_shape": [44, 160, 3], "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 1, "activation": "linear", "name": "convolution2d_1", "b_regularizer": null, "trainable": true, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "b_constraint": null, "nb_filter": 3, "W_constraint": null, "nb_row": 1, "activity_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "activation": "linear", "name": "convolution2d_2", "b_regularizer": null, "trainable": true, "subsample": [2, 2], "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "b_constraint": null, "nb_filter": 24, "W_constraint": null, "nb_row": 5, "activity_regularizer": null, "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "activation": "linear", "name": "convolution2d_3", "b_regularizer": null, "trainable": true, "subsample": [2, 2], "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "b_constraint": null, "nb_filter": 36, "W_constraint": null, "nb_row": 5, "activity_regularizer": null, "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "activation": "linear", "name": "convolution2d_4", "b_regularizer": null, "trainable": true, "subsample": [2, 2], "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "b_constraint": null, "nb_filter": 48, "W_constraint": null, "nb_row": 5, "activity_regularizer": null, "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "activation": "linear", "name": "convolution2d_5", "b_regularizer": null, "trainable": true, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "b_constraint": null, "nb_filter": 64, "W_constraint": null, "nb_row": 3, "activity_regularizer": null, "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "activation": "linear", "name": "convolution2d_6", "b_regularizer": null, "trainable": true, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "b_constraint": null, "nb_filter": 64, "W_constraint": null, "nb_row": 3, "activity_regularizer": null, "bias": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_1", "b_regularizer": null, "input_dim": null, "b_constraint": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "output_dim": 100}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_2", "b_regularizer": null, "input_dim": null, "b_constraint": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "output_dim": 50}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_7", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_3", "b_regularizer": null, "input_dim": null, "b_constraint": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "output_dim": 1}}]}