{"config": [{"config": {"trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 44, 160, 3], "output_shape_type": "raw", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-32-b95e1e6772b2>\u00da\b<lambda>\u0002\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": [44, 160, 3], "name": "lambda_1", "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"trainable": true, "subsample": [4, 4], "b_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "bias": true, "W_regularizer": null, "activity_regularizer": null, "name": "convolution2d_1", "activation": "linear", "nb_col": 8, "nb_row": 8, "b_constraint": null, "init": "glorot_uniform", "nb_filter": 16, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "subsample": [2, 2], "b_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "bias": true, "W_regularizer": null, "activity_regularizer": null, "name": "convolution2d_2", "activation": "linear", "nb_col": 5, "nb_row": 5, "b_constraint": null, "init": "glorot_uniform", "nb_filter": 32, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "subsample": [2, 2], "b_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "bias": true, "W_regularizer": null, "activity_regularizer": null, "name": "convolution2d_3", "activation": "linear", "nb_col": 5, "nb_row": 5, "b_constraint": null, "init": "glorot_uniform", "nb_filter": 64, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "name": "dense_1", "activation": "linear", "init": "glorot_uniform", "output_dim": 512, "input_dim": null, "bias": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "name": "dense_2", "activation": "linear", "init": "glorot_uniform", "output_dim": 1, "input_dim": null, "bias": true, "b_constraint": null}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}