{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "nb_col": 3, "nb_row": 3, "b_constraint": null, "bias": true, "input_dtype": "float32", "dim_ordering": "tf", "nb_filter": 24, "trainable": true, "border_mode": "same", "batch_input_shape": [null, 44, 160, 3], "W_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "W_constraint": null, "activity_regularizer": null, "activation": "linear", "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "nb_col": 3, "nb_row": 3, "init": "glorot_uniform", "bias": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 36, "trainable": true, "border_mode": "same", "W_regularizer": null, "subsample": [2, 2], "W_constraint": null, "activity_regularizer": null, "activation": "linear", "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "nb_col": 3, "nb_row": 3, "init": "glorot_uniform", "bias": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 48, "trainable": true, "border_mode": "same", "W_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "activation": "linear", "b_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.4, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "init": "glorot_uniform", "bias": true, "b_constraint": null, "output_dim": 100, "trainable": true, "input_dim": null, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.4, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "init": "glorot_uniform", "bias": true, "b_constraint": null, "output_dim": 50, "trainable": true, "input_dim": null, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.4, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "init": "glorot_uniform", "bias": true, "b_constraint": null, "output_dim": 1, "trainable": true, "input_dim": null, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "b_regularizer": null}}]}