{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-18-9a71d7a5ea64>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "batch_input_shape": [null, 44, 160, 3], "output_shape": [44, 160, 3], "arguments": {}, "output_shape_type": "raw", "trainable": true, "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "border_mode": "same", "activity_regularizer": null, "W_regularizer": null, "nb_filter": 16, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "name": "convolution2d_1", "bias": true, "nb_row": 5, "dim_ordering": "tf", "activation": "linear", "b_constraint": null, "b_regularizer": null, "subsample": [4, 4]}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "border_mode": "same", "activity_regularizer": null, "W_regularizer": null, "nb_filter": 32, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "name": "convolution2d_2", "bias": true, "nb_row": 3, "dim_ordering": "tf", "activation": "linear", "b_constraint": null, "b_regularizer": null, "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "border_mode": "same", "activity_regularizer": null, "W_regularizer": null, "nb_filter": 64, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "name": "convolution2d_3", "bias": true, "nb_row": 3, "dim_ordering": "tf", "activation": "linear", "b_constraint": null, "b_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"input_dim": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "name": "dense_1", "bias": true, "output_dim": 512, "trainable": true, "activation": "linear", "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"input_dim": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "name": "dense_2", "bias": true, "output_dim": 1, "trainable": true, "activation": "linear", "b_constraint": null}}]}