{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "function_type": "lambda", "output_shape_type": "raw", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-19-1872f279606c>\u00da\b<lambda>\u0005\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 40, 160, 3], "trainable": true, "arguments": {}, "output_shape": [40, 160, 3]}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_col": 3, "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "he_normal", "nb_row": 3, "activation": "linear", "name": "conv1", "dim_ordering": "tf", "border_mode": "valid", "nb_filter": 32, "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_col": 3, "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "he_normal", "nb_row": 3, "activation": "linear", "name": "conv2", "dim_ordering": "tf", "border_mode": "valid", "nb_filter": 32, "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_col": 3, "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "he_normal", "nb_row": 3, "activation": "linear", "name": "conv3", "dim_ordering": "tf", "border_mode": "valid", "nb_filter": 64, "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_col": 3, "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "he_normal", "nb_row": 3, "activation": "linear", "name": "conv4", "dim_ordering": "tf", "border_mode": "valid", "nb_filter": 64, "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_col": 3, "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "he_normal", "nb_row": 3, "activation": "linear", "name": "conv5", "dim_ordering": "tf", "border_mode": "valid", "nb_filter": 128, "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_col": 3, "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "he_normal", "nb_row": 3, "activation": "linear", "name": "conv6", "dim_ordering": "tf", "border_mode": "valid", "nb_filter": 128, "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_3", "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "he_normal", "activation": "linear", "output_dim": 512, "name": "hidden1", "bias": true, "input_dim": null, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "he_normal", "activation": "linear", "output_dim": 64, "name": "hidden2", "bias": true, "input_dim": null, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_8", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_5"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "he_normal", "activation": "linear", "output_dim": 16, "name": "hidden3", "bias": true, "input_dim": null, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_9", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "he_normal", "activation": "linear", "output_dim": 1, "name": "output", "bias": true, "input_dim": null, "activity_regularizer": null, "W_regularizer": null}}]}