{"config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-31-edab45c5d2e1>\u00da\b<lambda>\u0002\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "arguments": {}, "input_dtype": "float32", "batch_input_shape": [null, 44, 160, 3], "name": "lambda_1", "function_type": "lambda", "trainable": true, "output_shape": [44, 160, 3]}, "class_name": "Lambda"}, {"config": {"subsample": [4, 4], "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "nb_col": 8, "W_regularizer": null, "border_mode": "same", "bias": true, "nb_filter": 16, "name": "convolution2d_1", "W_constraint": null, "activation": "linear", "trainable": true, "dim_ordering": "tf", "nb_row": 8}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"subsample": [2, 2], "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "nb_col": 5, "W_regularizer": null, "border_mode": "same", "bias": true, "nb_filter": 32, "name": "convolution2d_2", "W_constraint": null, "activation": "linear", "trainable": true, "dim_ordering": "tf", "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"subsample": [2, 2], "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "nb_col": 5, "W_regularizer": null, "border_mode": "same", "bias": true, "nb_filter": 64, "name": "convolution2d_3", "W_constraint": null, "activation": "linear", "trainable": true, "dim_ordering": "tf", "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"p": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "init": "glorot_uniform", "output_dim": 512, "b_constraint": null, "activation": "linear", "b_regularizer": null, "input_dim": null, "W_regularizer": null, "bias": true, "W_constraint": null, "name": "dense_1", "trainable": true}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "init": "glorot_uniform", "output_dim": 1, "b_constraint": null, "activation": "linear", "b_regularizer": null, "input_dim": null, "W_regularizer": null, "bias": true, "W_constraint": null, "name": "dense_2", "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}