{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "input_dtype": "float32", "b_regularizer": null, "border_mode": "same", "name": "convolution2d_1", "init": "glorot_uniform", "subsample": [2, 2], "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_row": 5, "nb_col": 5, "W_regularizer": null, "batch_input_shape": [null, 48, 160, 3], "nb_filter": 24, "W_constraint": null, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "border_mode": "same", "name": "convolution2d_2", "init": "glorot_uniform", "subsample": [2, 2], "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_row": 5, "nb_col": 5, "W_regularizer": null, "nb_filter": 36, "W_constraint": null, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "border_mode": "same", "name": "convolution2d_3", "init": "glorot_uniform", "subsample": [2, 2], "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_row": 5, "nb_col": 5, "W_regularizer": null, "nb_filter": 48, "W_constraint": null, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "border_mode": "same", "name": "convolution2d_4", "init": "glorot_uniform", "subsample": [1, 1], "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_row": 3, "nb_col": 3, "W_regularizer": null, "nb_filter": 64, "W_constraint": null, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "border_mode": "same", "name": "convolution2d_5", "init": "glorot_uniform", "subsample": [1, 1], "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_row": 3, "nb_col": 3, "W_regularizer": null, "nb_filter": 64, "W_constraint": null, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "output_dim": 100, "b_constraint": null, "bias": true, "W_regularizer": null, "input_dim": null, "W_constraint": null, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "output_dim": 50, "b_constraint": null, "bias": true, "W_regularizer": null, "input_dim": null, "W_constraint": null, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "name": "dense_3", "init": "glorot_uniform", "output_dim": 1, "b_constraint": null, "bias": true, "W_regularizer": null, "input_dim": null, "W_constraint": null, "activity_regularizer": null, "activation": "linear"}}], "keras_version": "1.1.2"}