{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"subsample": [2, 2], "W_constraint": null, "nb_filter": 24, "border_mode": "same", "activation": "linear", "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null, "nb_row": 3, "input_dtype": "float32", "b_constraint": null, "trainable": true, "W_regularizer": null, "batch_input_shape": [null, 44, 160, 3], "name": "convolution2d_1", "bias": true, "nb_col": 3, "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "W_constraint": null, "nb_filter": 36, "border_mode": "same", "activation": "linear", "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "nb_row": 3, "b_constraint": null, "trainable": true, "W_regularizer": null, "name": "convolution2d_2", "bias": true, "dim_ordering": "tf", "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_filter": 48, "border_mode": "same", "activation": "linear", "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "nb_row": 3, "b_constraint": null, "trainable": true, "W_regularizer": null, "name": "convolution2d_3", "bias": true, "dim_ordering": "tf", "init": "glorot_uniform"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.4}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "b_regularizer": null, "activity_regularizer": null, "output_dim": 100, "trainable": true, "W_regularizer": null, "b_constraint": null, "bias": true, "name": "dense_1", "init": "glorot_uniform", "input_dim": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.4}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "b_regularizer": null, "activity_regularizer": null, "output_dim": 50, "trainable": true, "W_regularizer": null, "b_constraint": null, "bias": true, "name": "dense_2", "init": "glorot_uniform", "input_dim": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.4}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "b_regularizer": null, "activity_regularizer": null, "output_dim": 1, "trainable": true, "W_regularizer": null, "b_constraint": null, "bias": true, "name": "dense_3", "init": "glorot_uniform", "input_dim": null}}]}