{"config": [{"config": {"name": "convolution2d_1", "bias": true, "activity_regularizer": null, "border_mode": "same", "b_constraint": null, "activation": "linear", "nb_row": 3, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "nb_filter": 24, "W_constraint": null, "input_dtype": "float32", "subsample": [2, 2], "batch_input_shape": [null, 44, 160, 3]}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "convolution2d_2", "b_regularizer": null, "activity_regularizer": null, "border_mode": "same", "b_constraint": null, "subsample": [2, 2], "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "W_regularizer": null, "bias": true, "dim_ordering": "tf", "trainable": true, "nb_filter": 36, "W_constraint": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "convolution2d_3", "b_regularizer": null, "activity_regularizer": null, "border_mode": "same", "b_constraint": null, "subsample": [1, 1], "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "W_regularizer": null, "bias": true, "dim_ordering": "tf", "trainable": true, "nb_filter": 48, "W_constraint": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.4}, "class_name": "Dropout"}, {"config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"input_dim": null, "name": "dense_1", "bias": true, "activity_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "output_dim": 100, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.4}, "class_name": "Dropout"}, {"config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"input_dim": null, "name": "dense_2", "bias": true, "activity_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "output_dim": 50, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.4}, "class_name": "Dropout"}, {"config": {"name": "elu_5", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"input_dim": null, "name": "dense_3", "bias": true, "activity_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "output_dim": 1, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "linear"}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}