{"config": [{"config": {"output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-18-9a71d7a5ea64>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "arguments": {}, "function_type": "lambda", "input_dtype": "float32", "output_shape": [30, 160, 3], "batch_input_shape": [null, 30, 160, 3], "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"activation": "linear", "b_regularizer": null, "activity_regularizer": null, "bias": true, "trainable": true, "subsample": [4, 4], "nb_filter": 16, "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_1", "dim_ordering": "tf", "nb_row": 5, "b_constraint": null, "border_mode": "same", "W_constraint": null, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"activation": "linear", "b_regularizer": null, "activity_regularizer": null, "bias": true, "trainable": true, "subsample": [2, 2], "nb_filter": 32, "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_2", "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"activation": "linear", "b_regularizer": null, "activity_regularizer": null, "bias": true, "trainable": true, "subsample": [2, 2], "nb_filter": 64, "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_3", "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"activation": "linear", "b_regularizer": null, "activity_regularizer": null, "bias": true, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_1", "b_constraint": null, "W_constraint": null, "input_dim": null, "output_dim": 512}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"activation": "linear", "b_regularizer": null, "activity_regularizer": null, "bias": true, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_2", "b_constraint": null, "W_constraint": null, "input_dim": null, "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}