{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "batch_input_shape": [null, 44, 160, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-36-b95e1e6772b2>\u00da\b<lambda>\u0002\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "trainable": true, "input_dtype": "float32", "output_shape_type": "raw", "function_type": "lambda", "output_shape": [44, 160, 3]}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "name": "convolution2d_1", "bias": true, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "nb_row": 8, "nb_filter": 16, "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "subsample": [4, 4], "W_constraint": null, "W_regularizer": null, "nb_col": 8, "border_mode": "same"}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "name": "convolution2d_2", "bias": true, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "nb_row": 5, "nb_filter": 32, "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "subsample": [2, 2], "W_constraint": null, "W_regularizer": null, "nb_col": 5, "border_mode": "same"}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "name": "convolution2d_3", "bias": true, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "nb_row": 5, "nb_filter": 64, "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "subsample": [2, 2], "W_constraint": null, "W_regularizer": null, "nb_col": 5, "border_mode": "same"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_1", "bias": true, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "activation": "linear", "W_constraint": null, "W_regularizer": null, "output_dim": 512, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_2", "bias": true, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "activation": "linear", "W_constraint": null, "W_regularizer": null, "output_dim": 1, "activity_regularizer": null}}]}